In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
from sklearn.preprocessing import MinMaxScaler

In [2]:
data = pd.read_csv("/Users/yashraj146/Documents/DSBDAL/Assign3/Iris.csv")
data.head()

   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1           3.5            1.4           0.2  Iris-setosa
1   2            4.9           3.0            1.4           0.2  Iris-setosa
2   3            4.7           3.2            1.3           0.2  Iris-setosa
3   4            4.6           3.1            1.5           0.2  Iris-setosa
4   5            5.0           3.6            1.4           0.2  Iris-setosa

In [3]:
data.describe()

               Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm
count  150.000000     150.000000    150.000000     150.000000    150.000000
mean    75.500000       5.843333      3.054000       3.758667      1.198667
std     43.445368       0.828066      0.433594       1.764420      0.763161
min      1.000000       4.300000      2.000000       1.000000      0.100000
25%     38.250000       5.100000      2.800000       1.600000      0.300000
50%     75.500000       5.800000      3.000000       4.350000      1.300000
75%    112.750000       6.400000      3.300000       5.100000      1.800000
max    150.000000       7.900000      4.400000       6.900000      2.500000

In [4]:
data.dtypes

Id                 int64
SepalLengthCm    float64
SepalWidthCm     float64
PetalLengthCm    float64
PetalWidthCm     float64
Species           object
dtype: object

In [5]:
data.isnull().sum()

Id               0
SepalLengthCm    0
SepalWidthCm     0
PetalLengthCm    0
PetalWidthCm     0
Species          0
dtype: int64

In [6]:
data.groupby('Species')['PetalLengthCm'].agg(['min', 'max', 'std', 'mean', 'median']).reset_index()

           Species  min  max       std   mean  median
0      Iris-setosa  1.0  1.9  0.173511  1.464    1.50
1  Iris-versicolor  3.0  5.1  0.469911  4.260    4.35
2   Iris-virginica  4.5  6.9  0.551895  5.552    5.55

In [7]:
data['Species'].astype('category').cat.codes.unique().tolist()

[0, 1, 2]

<h1>NBA Dataset</h1>

In [8]:
df = pd.read_csv("/Users/yashraj146/Documents/DSBDAL/Assign3/nba.csv")
df.head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0

In [9]:
df.shape

(458, 9)

In [10]:
df.isnull().sum()

Name         1
Team         1
Number       1
Position     1
Age          1
Height       1
Weight       1
College     85
Salary      12
dtype: int64

In [11]:
df['College'] = df['College'].ffill()

In [12]:
df.isnull().sum()

Name         1
Team         1
Number       1
Position     1
Age          1
Height       1
Weight       1
College      0
Salary      12
dtype: int64

In [13]:
df['Salary'] = df['Salary'].fillna(df['Salary'].mean())

In [14]:
df.dropna(inplace = True)

In [15]:
df.describe()

           Number         Age      Weight        Salary
count  457.000000  457.000000  457.000000  4.570000e+02
mean    17.678337   26.938731  221.522976  4.842684e+06
std     15.966090    4.404016   26.368343  5.165781e+06
min      0.000000   19.000000  161.000000  3.088800e+04
25%      5.000000   24.000000  200.000000  1.100602e+06
50%     13.000000   26.000000  220.000000  2.869440e+06
75%     25.000000   30.000000  240.000000  6.331404e+06
max     99.000000   40.000000  307.000000  2.500000e+07

In [16]:
df['Team'].unique()

array(['Boston Celtics', 'Brooklyn Nets', 'New York Knicks',
       'Philadelphia 76ers', 'Toronto Raptors', 'Golden State Warriors',
       'Los Angeles Clippers', 'Los Angeles Lakers', 'Phoenix Suns',
       'Sacramento Kings', 'Chicago Bulls', 'Cleveland Cavaliers',
       'Detroit Pistons', 'Indiana Pacers', 'Milwaukee Bucks',
       'Dallas Mavericks', 'Houston Rockets', 'Memphis Grizzlies',
       'New Orleans Pelicans', 'San Antonio Spurs', 'Atlanta Hawks',
       'Charlotte Hornets', 'Miami Heat', 'Orlando Magic',
       'Washington Wizards', 'Denver Nuggets', 'Minnesota Timberwolves',
       'Oklahoma City Thunder', 'Portland Trail Blazers', 'Utah Jazz'],
      dtype=object)

In [17]:
age_salary = df[['Age', 'Salary']]
age_salary.head()

    Age        Salary
0  25.0  7.730337e+06
1  25.0  6.796117e+06
2  27.0  4.842684e+06
3  22.0  1.148640e+06
4  29.0  5.000000e+06

In [18]:
age_salary.min()

Age          19.0
Salary    30888.0
dtype: float64

In [19]:
age_salary.max()

Age             40.0
Salary    25000000.0
dtype: float64

In [20]:
bins = [19,25,31,36,40]
labels = ['19-24', '25-30', '31-35', '36-40']
age_salary['AgeGroup'] = pd.cut(age_salary['Age'], bins = bins, labels = labels, include_lowest = True)

/var/folders/p_/p55nsbbx3t74jm_36w0vdsg80000gn/T/ipykernel_17769/1441556103.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  age_salary['AgeGroup'] = pd.cut(age_salary['Age'], bins = bins, labels = labels, include_lowest = True)

In [21]:
age_salary.head()

    Age        Salary AgeGroup
0  25.0  7.730337e+06    19-24
1  25.0  6.796117e+06    19-24
2  27.0  4.842684e+06    25-30
3  22.0  1.148640e+06    19-24
4  29.0  5.000000e+06    25-30

In [22]:
age_salary['AgeGroup'].value_counts()

AgeGroup
19-24    199
25-30    189
31-35     56
36-40     13
Name: count, dtype: int64

In [23]:
age_groups = age_salary.groupby('AgeGroup')

/var/folders/p_/p55nsbbx3t74jm_36w0vdsg80000gn/T/ipykernel_17769/3769757657.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  age_groups = age_salary.groupby('AgeGroup')

In [24]:
age_groups["Salary"].describe()

,count,mean,std,min,25%,50%,75%,max
AgeGroup,,,,,,,,
19-24,199.0,3.030670e+06,3.536368e+06,30888.0,947276.00,1.709719e+06,3495566.5,16407501.0
25-30,189.0,6.635459e+06,5.825556e+06,55722.0,1500000.00,4.842684e+06,10151612.0,22970500.0
31-35,56.0,5.113016e+06,5.283815e+06,200600.0,1323709.25,3.646250e+06,6350000.0,22875000.0
36-40,13.0,5.351744e+06,6.508388e+06,222888.0,947726.00,4.088019e+06,5250000.0,25000000.0